---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ItemCustomId
source: html/798293bc-cc61-95a2-26d5-b67633859a14.htm
---
# Autodesk.Revit.DB.FabricationPart.ItemCustomId Property

The item custom identifier for the fabrication part.

## Syntax (C#)
```csharp
public int ItemCustomId { get; }
```